Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: A type that provides a view into an encoder’s storage and is used to hold the encoded properties of an encodable type in a keyed manner.
ja: ある型で、あるエンコーダの持つストレージへのビューを提供し、そしてエンコード可能型のエンコードされたプロパティをキー流儀で保持するために使われます。

source: A type that provides a view into an encoder’s storage and is used to hold the encoded properties of an encodable type sequentially, without keys.
ja: ある型で、あるエンコーダの持つストレージへのビューを提供し、そしてエンコード可能型のエンコードされたプロパティを順次的に、キーなしで保持するために使われます。

source: A type that provides an iteration interface over the results of tasks added to the group.
ja: ある型、それはグループに追加されたタスクの結果それらすべてにわたる反復インターフェイスを提供します。

source: A type that provides asynchronous, sequential, iterated access to its elements.
ja: ある型、それはそれの要素それらに対して非同期の、順次的な、反復したアクセスを提供するものです。

source: A type that provides mathematical set operations.
ja: 数学的な集合演算を提供する型。

source: A type that provides sequential, iterated access to its elements.
ja: 順次的な、繰り返されるアクセスをそれの要素に提供するある型。

source: A type that provides the collection’s iteration interface and encapsulates its iteration state.
ja: そのコレクションの持つ反復インターフェイスを提供してそれの反復状態をカプセル化するある型。

source: A type that provides the sequence’s iteration interface and encapsulates its iteration state.
ja: そのシーケンスの持つ反復インターフェイスを提供してそれの反復状態をカプセル化するある型。

source: A type that provides uniformly distributed random data.
ja: 一様分布無作為データを提供する型。

source: A type that represents a Unicode scalar literal.
ja: ユニコードスカラーリテラルを表すある型。

source: A type that represents a globally-unique actor that can be used to isolate various declarations anywhere in the program.
ja: ある型、それはあるグローバルに特有なアクターを表します、それはさまざまな宣言をどこでもプログラムの中で分離するために使用できます。

source: A type that represents a position in the collection.
ja: コレクションの中のある位置を表す型。

source: A type that represents a string literal.
ja: ある文字列リテラルを表す型。

source: A type that represents an extended grapheme cluster literal.
ja: 拡張書記素クラスタリテラルを表すある型。

source: A type that represents an integer literal.
ja: ある整数リテラルを表す型。

source: A type that represents either a wrapped value or nil, the absence of a value.
ja: ラップされた値または、値の不在であるnil、どちらかを表すある型。

source: A type that represents the distance between two pointers.
ja: ２つのポインタの間の隔たりを表すある型。

source: A type that represents the distance between two values.
ja: ２つの値の間の隔たりを表す型。

source: A type that represents the indices that are valid for subscripting the collection, in ascending order.
ja: 昇順での、コレクションの添え字として有効なインデックスを表す型。

source: A type that represents the number of steps between two String.Index values, where one value is reachable from the other.
ja: 一方の値が他方から到達可能であるところの２つのString.Index値の間の段階数を表すある型。

source: A type that represents the words of this integer.
ja: この整数のワードを表す型。

source: A type that supplies a custom description for playground logging.
ja: プレイグラウンドログのためにあつらえの記述を提供する型。

source: A type that supplies the values of a sequence one at a time.
ja: あるシーケンスに属する値を一度に１つ提供する型。

source: A type whose instances can be encoded, and appropriately passed, as elements of a C va_list.
ja: それのインスタンスが、符号化されること、そして適切に渡されることが、C va_listの要素として可能である型。

source: A type with a customized textual representation suitable for debugging purposes.
ja: デバッグ目的に都合がよいようにカスタマイズされた原文の表現を持つ型。

source: A type with a customized textual representation.
ja: カスタマイズされた原文の表現を持つ型。

source: A type with values that support addition and subtraction.
ja: 加算と減算をサポートする値を持つ型。

source: A type with values that support multiplication.
ja: 乗算をサポートする値をもつ型。

source: A type-erased hashable value.
ja: 型消去ハッシュ可能値。

source: A type-erased iterator of Element.
ja: Elementの型消去イテレータ。

source: A type-erased key path, from any root type to any resulting value type.
ja: 型消去キーパス、何らかの根本の型から何らかの結果値の型への。

source: A type-erased sequence.
ja: 型消去シーケンス。

source: A type-erased wrapper over any collection with indices that support bidirectional traversal.
ja: ２方向に辿っていくことをサポートするインデックスを持つあらゆるコレクションを覆う型消去ラッパー。

source: A type-erased wrapper over any collection with indices that support forward traversal.
ja: 前へ辿っていくことをサポートするインデックスを持つあらゆるコレクションを覆う型消去ラッパー。

source: A type-erased wrapper over any collection with indices that support random access traversal.
ja: 無作為アクセスで辿っていくことをサポートするインデックスを持つあらゆるコレクションを覆う型消去ラッパー。

source: A typed buffer of the memory referenced by this raw buffer.
ja: この生のバッファによって参照されるメモリの型付バッファ。

source: A typed buffer of the newly bound memory.
ja: 新しく束縛されたメモリの型付バッファ。

source: A typed pointer to the memory referenced by this raw pointer.
ja: この生のポインタによって参照されるメモリへの型付ポインタ。

source: A typed pointer to the newly bound memory.
ja: 新しく束縛されたメモリへの型付ポインタ。

source: A typed pointer to the same memory as this raw pointer.
ja: この生のポインタと同じメモリに対する型付ポインタ。

source: A unicode scalar value to be used when repairing encoding/decoding errors, as represented in this encoding.
ja: 符号化／復号エラーを修復している時に使われるあるユニコードスカラー値、この符号化において表現されるとおりに。

source: A unique identifier for a class instance or metatype.
ja: あるクラスインスタンスまたはメタタイプのための固有な識別子。

source: A unit of asynchronous work.
ja: 非同期作業のある単位。

source: A unit of scheduleable work.
ja: 予定可能な仕事の単位。

source: A user-defined key for providing context during encoding and decoding.
ja: エンコーディングおよびデコーディングの間にコンテキストを提供するためのユーザ定義のキー。

source: A valid index of the array.
ja: この配列の有効なインデックス。

source: A valid index of the character view.
ja: 文字ビューの有効なインデックス。

source: A valid index of the collection to use as a limit.
ja: 限度として使うためのそのコレクションの有効なインデックス。

source: A valid index of the collection.
ja: そのコレクションの有効なインデックス。

source: A valid index of the string.
ja: 文字列の有効なインデックス。

source: A valid index of the view.
ja: このビューの有効なインデックス。

source: A valid scalar value as represented in this encoding
ja: この符号化において表現されるある有効なスカラー値。

source: A value less than or equal to the number of elements in the collection.
ja: このコレクションの中の要素の数より少ないか等しい値。

source: A value less than or equal to the number of elements in the sequence, calculated nondestructively.
ja: シーケンスの要素数より少ないか等しい値、非破壊的に計算されます。

source: A value of the requested type, if present for the given key and convertible to the requested type.
ja: 要請された型の値、もし与えられたキーに対して存在して要請された型に変換可能ならば。

source: A value of the requested type.
ja: 要請された型の値。

source: A value that is offset from this value by n.
ja: この値からnをオフセットされる値。

source: A value that provides access to properties of a Unicode scalar that are defined by the Unicode standard.
ja: ユニコード標準によって定義されるユニコードスカラーのプロパティに対するアクセスを提供する値。

source: A value that represents either a success or a failure, including an associated value in each case.
ja: 成功または失敗のどちらかを表すある値、それぞれの場合での関連値を含みます。

source: A value to compare.
ja: 比較する値。

source: A value to convert to this type of integer.
ja: この型の整数へと変換される値。

source: A value to either return or throw from the continuation.
ja: その継続から返すまたはスローするどちらかの値。

source: A value to use as the big-endian representation of the new integer.
ja: 新しい整数のビッグエンディアン表現として使う値。

source: A value to use as the little-endian representation of the new integer.
ja: 新しい整数のリトルエンディアン表現として使う値。

source: A value to use as the source of the new instance’s binary representation.
ja: 新しいインスタンスの持つバイナリ表現のソースとして使うための値。

source: A value type whose instances are either true or false.
ja: ある値型、そのインスタンスはtrueかfalseです。

source: A vector mask that is the pointwise exclusive or of the inputs.
ja: 入力それらのポイント単位排他的論理和であるベクターマスク。

source: A vector mask that is the pointwise logical conjunction of the inputs.
ja: この入力のポイント単位論理積であるベクターマスク。

source: A vector mask that is the pointwise logical disjunction of the inputs.
ja: この入力のポイント単位論理和であるベクターマスク。

source: A vector mask that is the pointwise logical negation of the input.
ja: この入力のポイント単位論理否定であるベクターマスク。

source: A vector mask with the result of a pointwise equality comparison.
ja: あるポイント単位同等比較の結果を持つベクターマスク。

source: A vector mask with the result of a pointwise inequality comparison.
ja: あるポイント単位不等比較の結果をもつベクターマスク。

source: A vector of 16 scalar values.
ja: 16スカラー値のベクター。

source: A vector of 32 scalar values.
ja: 32スカラー値のベクター。

source: A vector of 64 scalar values.
ja: 64スカラー値のベクター。

source: A vector of eight scalar values.
ja: ８つのスカラー値のベクター。

source: A vector of four scalar values.
ja: ４つのスカラー値のベクター。

source: A vector of three scalar values.
ja: ３つのスカラー値のベクター。

source: A vector of two scalar values.
ja: ２つのスカラー値のベクター。

source: A vector with the specified value in all lanes.
ja: 全てのレーンでこの指定された値を持つベクター。

source: A version of the Unicode Standard represented by its major and minor components.
ja: それのメジャーおよびマイナー部分によって表されるユニコード標準のあるバージョン。

source: A view into a subsequence of elements of another collection.
ja: ある見方、別のコレクションのいくらかの要素からなる下位シーケンスです。

source: A view of a string’s contents as a collection of UTF-16 code units.
ja: ある文字列の内容のひとつの見方、いくらかのUTF-16コード単位のコレクションとして。

source: A view of a string’s contents as a collection of UTF-8 code units.
ja: ある文字列の内容のひとつの見方、いくらかのUTF-8コード単位のコレクションとして。

source: A view of a string’s contents as a collection of Unicode scalar values.
ja: ある文字列の内容のひとつの見方、いくらかのユニコードスカラー値のコレクションとして。

source: A wrapper around a C va_list pointer.
ja: C va_listポインタの周りのラッパー。

source: A wrapper around an opaque C pointer.
ja: 不透明Cポインターの周りのラッパー。

source: A wrapper over an underlying index that hides the specific underlying type.
ja: 根底にあるインデックスを覆うラッパー、根底にある特定の型を隠します。

source: ASCII characters have a scalar value between 0 and 127, inclusive.
ja: ASCII文字は、０と127の間の、それらを含む、スカラー値を持ちます。

source: Access a pointer to a variable in memory for explicit passing to C functions.
ja: メモリ中のある変数へのポインタに明示的にC関数を渡すためにアクセスします。

source: Accesses a contiguous subrange of the buffer’s elements.
ja: バッファの持つ要素の隣接下位範囲にアクセスします。

source: Accesses a contiguous subrange of the collection’s elements.
ja: コレクションのもついくらかの要素からなるある連続した下位範囲にアクセスします。

source: Accesses the Unicode scalar value at the given position.
ja: 指定された位置でユニコードスカラーにアクセスします。

source: Accesses the byte at the given offset in the memory region as a UInt8 value.
ja: 与えられたオフセットでメモリ領域においてUInt8値としてバイトにアクセスします。

source: Accesses the bytes in the specified memory region.
ja: 指定されたメモリ領域においてバイトにアクセスします。

source: Accesses the character at the given position.
ja: 与えられた位置で文字にアクセスします。

source: Accesses the code unit at the given position.
ja: 与えられた位置でのコード単位にアクセスします。

source: Accesses the code unit at the specified position.
ja: 指定された位置でのコード単位にアクセスします。

source: Accesses the contiguous subrange of the collection’s elements specified by a range expression.
ja: 範囲式によって指定される、コレクションの要素からなる連続した下位範囲にアクセスします。

source: Accesses the element at the specified index.
ja: 指定されたインデックスでの要素にアクセスします。

source: Accesses the element at the specified position.
ja: 指定された位置で要素にアクセスします。

source: Accesses the instance referenced by this pointer.
ja: このポインタによって参照されるインスタンスにアクセスします。

source: Accesses the pointee at the specified offset from this pointer.
ja: このポインタから指定されたオフセットでPointeeにアクセスします。

source: Accessing Individual Results
ja: 個々の結果にアクセスする

source: Accessing Results
ja: 結果にアクセスする

source: Accessing String Elements
ja: 文字列要素にアクセスする

source: Accessing String View Elements
ja: 文字列ビュー要素にアクセスする

source: Accessing a Pointer’s Memory as a Different Type
ja: ポインタのもつメモリに異なる型としてアクセスする

source: Accessing a String’s Unicode Representation
ja: 文字列のユニコード表現にアクセスする

source: Accessing an Asynchronous Sequence of Results
ja: 結果それらからなるある非同期シーケンスにアクセスする

source: Accessing memory as a type T requires that the memory be bound to that type.
ja: メモリにある型Tとしてアクセスすることは、メモリがその型に束縛されることを必要とします。

source: Accessing memory as type T requires that the memory be bound to that type.
ja: メモリに型Tとしてアクセスすることは、メモリがその型に束縛されることを必要とします。

source: Accessing memory through the returned pointer is undefined if the memory has not been bound to T.
ja: 返されるポインタによってメモリにアクセスすることは、メモリがTに束縛されていないならば未定義です。

source: Accessing the utf8 view with these indices yields the first and second code UTF-8 units.
ja: utf8ビューにそれらのインデックスでアクセスすることは、１番目と２番目のUTF-8コード単位を生成します。

source: Accessing this collection’s bytes does not bind the underlying memory to UInt8.
ja: このコレクションのもつバイトにアクセスすることは、基礎をなすメモリをUInt8へとバインドしません。

source: Accessing this property when hasPointerRepresentation is false triggers a runtime error.
ja: hasPointerRepresentationがfalseである時にこのプロパティにアクセスすることは、実行時エラーの引き金となります。

source: Accessing this property when hasPointerRepresentation is true triggers a runtime error.
ja: hasPointerRepresentationがtrueである時にこのプロパティにアクセスすることは、実行時エラーの引き金となります。

source: Actors
ja: アクター

source: Add
ja: 加算

source: Add a child task to the group.
ja: ある子タスクをグループに加えます。

source: Add and assign
ja: 加算して代入する

source: Add one or more drinks using the app’s main view.
ja: １つ以上の飲み物を、アプリのメインビューを使って加えてください。

source: Add with overflow
ja: オーバーフロー加算

source: Add with overflow and assign
ja: 加算、オーバーフローと割り当てとともに

source: Adding Tasks to a Task Group
ja: タスクそれらをあるタスクグループに加える

source: Adding Tasks to a Throwing Task Group
ja: タスクそれらをあるスローするタスクグループに加える

source: Adds an element to the end of the collection.
ja: ある要素をコレクションの終わりに加えます。

source: Adds the elements of a sequence or collection to the end of this collection.
ja: あるシーケンスまたコレクションに属するいくつかの要素をこのコレクションの終わりに加えます。

source: Adds two values and produces their sum.
ja: ２つの値を加算してそれらの合計を生成します。

source: Adds two values and stores the result in the left-hand-side variable, wrapping any overflow.
ja: ２つの値を加算して結果を左手側の変数に格納します、あらゆるオーバーフローをラップします。

source: Adds two values and stores the result in the left-hand-side variable.
ja: ２つの値を加算して、結果を左手側の変数に格納します。

source: Adopt and interoperate with Cocoa design patterns in your Swift apps.
ja: CocoaデザインパターンをあなたのSwiftアプリにおいて採用および相互運用してください。

source: Advanced Collection Topics
ja: 先進のコレクション話題

source: Advanced Numerics
ja: 先進の数値

source: Advances to the next byte and returns it, or nil if no next byte exists.
ja: 次のバイトへ進んでそれを返します、または次のバイトが存在しないならばnilを返します。

source: Advances to the next element and returns it, or nil if no next element exists.
ja: 次の要素へ進んでそれを返します、または次の要素が存在しないならばnilを返します。

source: Advances to the result of the next child task, or nil if there are no remaining child tasks, rethrowing an error if the child task threw.
ja: 次の子タスクの結果に進みます、または残っている子タスクがないならばnil、子タスクがスローしたならばエラーを再スローします。

source: After a call to initialize(repeating:), the entire region of memory referenced by this buffer is initialized.
ja: initialize(repeating:)の呼び出しの後、このバッファによって参照されるメモリの全領域は初期化されます。

source: After a call to initialize(repeating:count:), the memory referenced by this pointer is initialized.
ja: initialize(repeating:count:)の呼び出しの後、このポインタによって参照されるメモリは初期化されます。

source: After a call to initialize(to:), the memory referenced by this pointer is initialized.
ja: initialize(to:)の呼び出しの後、このポインタによって参照されるメモリは初期化されます。

source: After adding CustomDebugStringConvertible conformance by implementing the debugDescription property, Point provides its own custom debugging representation.
ja: CustomDebugStringConvertible準拠をdebugDescriptionプロパティを実装することによって追加後は、Pointはそれ独自のあつらえのデバッグ表現を提供します。

source: After adding CustomStringConvertible conformance by implementing the description property, Point provides its own custom representation.
ja: CustomStringConvertible準拠をdescriptionプロパティの実装によって加えた後、Pointはそれ独自のあつらえの表現を提供します。

source: After calling bindMemory(to:capacity:), the first four bytes of the memory referenced by bytesPointer are bound to the Int8 type, though they remain uninitialized.
ja: bindMemory(to:capacity:)を呼んだ後、bytesPointerによって参照されるメモリの最初の４バイトはInt8型に束縛されます、もっともそれらは未初期化のままであるけれども。

source: After calling copyBytes(from:), the source.count bytes of memory referenced by this buffer are initialized to raw bytes.
ja: copyBytes(from:)を呼び出した後、このバッファによって参照されるメモリのsource.countバイトは生のバイトに初期化されます。

source: After calling copyMemory(from:), the first source.count bytes of memory referenced by this buffer are initialized to raw bytes.
ja: copyMemory(from:)を呼び出した後、このバッファによって参照されるメモリの最初のsource.countバイトは生のバイトに初期化されます。

source: After calling copyMemory(from:byteCount:), the byteCount bytes of memory referenced by this pointer are initialized to raw bytes.
ja: copyMemory(from:byteCount:)を呼び出した後、このポインタによって参照されるメモリのbyteCountバイトは生のバイトに初期化されます。

source: After calling move(), the memory is uninitialized.
ja: move()の呼び出しの後、メモリは初期化されない状態です。

source: After calling storeBytes(of:toByteOffset:as:), the memory is initialized to the raw bytes of value.
ja: storeBytes(of:toByteOffset:as:)を呼び出した後、メモリはvalueの生のバイトに初期化されます。

source: After calling deinitialize(count:), the memory is uninitialized, but still bound to the Pointee type.
ja: deinitialize(count:)の呼び出しの後、メモリは初期化されない状態です、しかし依然としてPointeeへの境界です。

source: After calling assign(from:count:), the region is initialized.
ja: assign(from:count:)の呼び出し後、この領域は初期化されます。

source: After calling assign(repeating:count:), the region is initialized.
ja: assign(repeating:count:)の呼び出し後、この領域は初期化されます。

source: After calling initialize(from:count:), the region is initialized.
ja: initialize(from:count:)の呼び出し後、この領域は初期化されます。

source: After calling initializeMemory(as:from:), the memory referenced by the returned UnsafeMutableBufferPointer instance is bound and initialized to type S.Element.
ja: initializeMemory(as:from:)呼び出しの後、UnsafeMutableBufferPointerインスタンスによって参照されるメモリは、型S.Elementに束縛され初期化されます。

source: After calling moveAssign(from:count:), the region is initialized and the memory region source..<(source + count) is uninitialized.
ja: moveAssign(from:count:)の呼び出し後、この領域は初期化されます、そしてメモリ領域source..<(source + count)は未初期化状態にされます。

source: After calling moveInitialize(from:count:), the region is initialized and the memory region source..<(source + count) is uninitialized.
ja: moveInitialize(from:count:)の呼び出し後、この領域は初期化されます、そしてメモリ領域source..<(source + count)は未初期化状態にされます。

source: After calling this method on a raw buffer with non-nil baseAddress b, the region starting at b and continuing up to b + self.count - self.count % MemoryLayout<T>.stride is bound to type T and initialized.
ja: このメソッドを生のバッファ上で非nilのbaseAddress bを使って呼び出した後、bで始まってb + self.count - self.count % MemoryLayout<T>.strideまで続く領域は、型Tに束縛されて初期化されます。

source: After calling this method on a raw pointer p, the region starting at p and continuing up to p + count * MemoryLayout<T>.stride is bound to type T and initialized.
ja: このメソッドを生のポインタp上で呼び出した後、pで始まってp + count * MemoryLayout<T>.strideまで続く領域は、型Tに束縛されて初期化されます。

source: After calling this method on a raw pointer p, the region starting at self and continuing up to p + count * MemoryLayout<T>.stride is bound to type T and initialized.
ja: このメソッドを生のポインタp上で呼び出した後、selfで始まってp + count * MemoryLayout<T>.strideまで続く領域は、型Tに束縛されて初期化されます。

source: After calling this method, control immediately returns to the caller.
ja: このメソッドを呼び出した後、制御はすぐに呼び出し側に返ります。

source: After canceling a group, adding a new task to it always fails.
ja: あるグループを取り消した後、新しいタスクをそれに加えることは、常に失敗します。

source: After configuring and running the Coffee Tracker app, you can test the background updates.
ja: Coffee Trackerアプリを構成設定および実行した後、あなたはバックグラウンド更新をテストできます。

source: After executing body, this method rebinds memory back to the original Element type.
ja: bodyの実行の後、このメソッドはメモリを元々のElement型に再束縛します。

source: After executing body, this method rebinds memory back to the original Pointee type.
ja: body実行の後、このメソッドは、オリジナルのPointee型へとメモリを再束縛し戻します。

source: After partitioning a collection, there is a pivot index p where no element before p satisfies the belongsInSecondPartition predicate and every element at or after p satisfies belongsInSecondPartition.
ja: コレクションを仕切った後、あるピボットインデックスpがあります、そこでpの前の要素は１つもbelongsInSecondPartition述部を満たさず、そしてpでのまたは後のあらゆる要素はbelongsInSecondPartitionを満たします。

source: After rebasing slice as the rebased buffer, the following are true:
ja: sliceをrebasedバッファとして再構築した後、以下のことが当てはまります：

source: After rebinding the memory referenced by uint8Pointer to UInt64, accessing that pointer’s referenced memory as a UInt8 instance is undefined.
ja: uint8Pointerによって参照されるメモリをUInt64に再束縛する後、そのポインタの参照したメモリにUInt8インスタンスとしてアクセスすることは未定義です。

source: After the call, the memory referenced by this buffer up to, but not including, the returned index is initialized.
ja: この呼び出しの後、返されるインデックスまでの、しかしそれを含んでいない、このバッファによって参照されるメモリは、初期化されます。

source: After the predicate returns false, the sequence never executes it again, and from then on the sequence passes through elements from its underlying sequence as-is.
ja: 述部がfalseを返した後、シーケンスはそれを決して再び遂行しません、そしてそれからシーケンス上では、要素それらをそれの基礎をなすシーケンスからそのままでずっと渡します。

source: After this code has executed, the following are true:
ja: このコードが実行された後、以下は真です：

source: After this method returns nil, this iterater is guaranteed to never produce more values.
ja: このメソッドがnilを返した後、このイテレータはそれ以上の値を決して生み出さないことを保証されます。

source: After using firstIndex(of:) to find the position of a particular element in a collection, you can use it to access the element by subscripting.
ja: firstIndex(of:)を使って特定の要素の位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするのにそれを使うことができます。

source: After using lastIndex(of:) to find the position of the last instance of a particular element in a collection, you can use it to access the element by subscripting.
ja: lastIndex(of:)を使って特定の要素の最後のインスタンスの位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするのにそれを使うことができます。

source: Algebraic Sets
ja: 代数的集合

source: Aliases for Imported C Types
ja: インポートされたC型に対するエイリアス

source: All 100 bytes of memory must eventually be deallocated.
ja: メモリの100バイトすべては、そのうち割り当てられなければなりません。

source: All elements satisfying this predicate are ordered after all elements not satisfying it.
ja: この述部を満たす全ての要素は、それを満たさない全ての要素の後に並べられます。

source: All the elements following i are moved to close the gap.
ja: iに続く要素すべては、隙間を埋めるように移動されます。

source: All the elements following the specified position are moved to close the gap.
ja: 指定された位置に続く要素すべては、隙間を埋めるように移動されます。

source: Allocate and manage memory manually.
ja: メモリを手動でアロケートして管理します。

source: Allocates uninitialized memory for the specified number of instances of type Element.
ja: 指定された数の型Elementのインスタンスに対して未初期化メモリを割り当てます。

source: Allocates uninitialized memory for the specified number of instances of type Pointee.
ja: 型Pointeeの指定された数のインスタンスに対して初期化されないメモリをアロケートします。

source: Allocates uninitialized memory with the specified size and alignment.
ja: 未初期化メモリをこの指定された大きさとアライメントでアロケートします。

source: Allow values of your type to be expressed using different kinds of literals.
ja: あなたの型の値に異なる種類のリテラルを使って表されることを可能にします。

source: Allow your custom types to be used with simple collection operations, such as contains(_:), and standard comparison operators.
ja: あなたのあつらえの型を、単純なコレクション演算、例えばcontains(_:)など、そして標準比較演算子とともに使われるようにしましょう。

source: Allows a nonescaping closure to temporarily be used as if it were allowed to escape.
ja: 非脱出クロージャに、一時的にそれが脱出することを許可されたかのように使われることを許可します。

source: Alphabetic scalars are the primary units of alphabets and/or syllabaries.
ja: アルファベットのスカラーは、アルファベットおよび／または音節文字の主要な単位です。

source: Also, the dictionary doesn’t provide a key for 4, and the closure throws an error for any key it can’t look up, so receiving this value from Counter ends the modified sequence with an error.
ja: また、辞書は4に対するキーを提供しません、そしてクロージャはそれが見つけることが出来ない何らかのキーに対してエラーをスローします、それでこの値をCounterから受け取ることはこの修正されたシーケンスをエラーで終わらせます。

source: Alternatively, a predicate can be satisfied by a range of Equatable elements or a general condition.
ja: あるいは、述部は、Equatable要素のある範囲またはある一般的条件によって満たされることができます。

source: Alternatively, use this method to sort a collection of elements that do conform to Comparable when you want the sort to be descending instead of ascending.
ja: そうではなくて、あなたが昇順ではなく降順でソートしたい場合は、このメソッドを使ってComparableに準拠する要素からなるコレクションをソートしてください。

source: Alternatively, you can access the same memory as a different type without rebinding through untyped memory access, so long as the bound type and the destination type are trivial types.
ja: その代わりに、あなたは同じメモリに異なる型として再束縛することなしにアクセスすることが型なしメモリアクセスを通して可能です、束縛される型と行き先の型が自明型である限りは。

source: Alternatively, you can convert the function that takes a String to one that is generic over the StringProtocol protocol.
ja: あるいは、あなたはStringをとる関数をStringProtocolプロトコルを越えて総称体であるものに変換できます。
